## Reading, writing excel & csv files
- Read CSV
- Write CSV
- Read Excel
- Write Excel

### Read CSV

In [3]:
import pandas as pd

df = pd.read_csv("Data\stock_data.csv")
df

<>:3: SyntaxWarning: invalid escape sequence '\s'
<>:3: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\2939621033.py:3: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data.csv")

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Skipping rows

In [4]:
df = pd.read_csv("Data\stock_data_extra_row.csv")
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\1660187586.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data_extra_row.csv")

                                            stocks
tickers eps           revenue price         people
GOOGL   27.82         87      845       larry page
WMT     4.61          484     65              n.a.
MSFT    -1            85      64        bill gates
RIL     not available 50      1023   mukesh ambani
TATA    5.6           -1      n.a.      ratan tata

In [5]:
df = pd.read_csv("Data\stock_data_extra_row.csv", skiprows=1)
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\300191666.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data_extra_row.csv", skiprows=1)

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [6]:
df = pd.read_csv("Data\stock_data_extra_row.csv", header=1)
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\2205160460.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data_extra_row.csv", header=1)

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Adding custom headers

In [7]:
df = pd.read_csv("Data\stock_data_no_header.csv")
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\2325576813.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data_no_header.csv")

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [8]:
df = pd.read_csv("Data\stock_data_no_header.csv", header=None)
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\2433778243.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data_no_header.csv", header=None)

       0              1    2     3              4
0  GOOGL          27.82   87   845     larry page
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3   RIL   not available   50  1023  mukesh ambani
4   TATA            5.6   -1  n.a.     ratan tata

In [9]:
df = pd.read_csv("Data\stock_data_no_header.csv", header=None, names=['tickers', 'eps', 'revenue', 'price', 'people'])
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\3315475720.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data_no_header.csv", header=None, names=['tickers', 'eps', 'revenue', 'price', 'people'])

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Getting number of rows

In [38]:
df = pd.read_csv("Data\stock_data.csv", nrows=3)
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\3888840511.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data.csv", nrows=3)

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

Replace certain values with NaN

In [12]:
df = pd.read_csv("Data\stock_data.csv", na_values=['not available', 'n.a.'])
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\2256200938.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data.csv", na_values=['not available', 'n.a.'])

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

Can also define for every column

In [14]:
df = pd.read_csv("Data\stock_data.csv", na_values={
    'eps': ['not available', 'n.a.'],
    'revenue': ['not available', 'n.a.', -1],
    'price': ['not available', 'n.a.'],
    'people': ['not available', 'n.a.']
})
df

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Nabla\AppData\Local\Temp\ipykernel_25944\2738724754.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("Data\stock_data.csv", na_values={

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

### Write CSV

In [15]:
df.to_csv("Data/new.csv")

Remove index

In [16]:
df.to_csv("Data/new1.csv", index=False)

Get only required columns

In [17]:
df.to_csv("Data/new2.csv", index=False, columns=['tickers', 'eps'])

Without header

In [18]:
df.to_csv("Data/new3.csv", header=False, index=False)

### Read Excel

In [20]:
df = pd.read_excel("Data/stock_data.xlsx")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Reading specific sheet from excel

In [21]:
df = pd.read_excel("Data/stock_data.xlsx", sheet_name='Sheet1')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Use of converter for replacing certain values

In [22]:
def convert_people_cell(cell):
    if cell == "n.a.":
        return "sam walton"
    return cell

df = pd.read_excel("Data/stock_data.xlsx", sheet_name='Sheet1', converters={
    'people': convert_people_cell
})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [24]:
def convert_cell(cell, replace_text):
    if cell == "n.a.":
        return replace_text
    return cell

df = pd.read_excel("Data/stock_data.xlsx", sheet_name='Sheet1', converters={
    'people': lambda cell: convert_cell(cell, replace_text="sam walton"),
    'price': lambda cell: convert_cell(cell, replace_text=0)
})
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65     sam walton
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1      0     ratan tata

### Write Excel

In [28]:
df.to_excel('Data/new.xlsx', sheet_name='stocks')

In [29]:
df.to_excel('Data/new1.xlsx', sheet_name='stocks', index=False)

Start writing in excel by skipping some rows and columns

In [30]:
df.to_excel('Data/new2.xlsx', sheet_name='stocks', startcol=2, startrow=2, index=False)

Write required columns

In [31]:
df.to_excel('Data/new3.xlsx', sheet_name='stocks', index=False, columns=['tickers', 'people'])

Write in multiple sheets

In [32]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [36]:
with pd.ExcelWriter('Data/new_stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks", index=False)
    df_weather.to_excel(writer, sheet_name="weather", index=False)